# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)
num = int(input('Введите трехзначное число: '))
while num < 99 or num > 1000:
    print('Введено некорректное число.')
    num = int(input('Введите трехзначное число: '))
if num > 99 and num < 1000: 
    num1 = num % 10
    num2 = num // 10 % 10
    num3 = num // 100
    sum = num1 + num2 + num3
    print(sum)